keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSmu_regdef.h
/** \\brief  Alarm and Fault Counter */
typedef struct _Ifx_SMU_AFCNT_Bits
{
    unsigned int FCNT:4;                    /**< \brief [3:0] Fault Counter. (rh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int ACNT:8;                    /**< \brief [15:8] Alarm Counter. (rh) */
    unsigned int reserved_16:14;            /**< \brief \internal Reserved */
    unsigned int FCO:1;                     /**< \brief [30:30] Fault Counter Overflow. (rh) */
    unsigned int ACO:1;                     /**< \brief [31:31] Alarm Counter Overflow. (rh) */
} Ifx_SMU_AFCNT_Bits;

/** \\brief  Alarm Status Register */
typedef struct _Ifx_SMU_AG_Bits
{
    unsigned int SF0:1;                     /**< \brief [0:0] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF1:1;                     /**< \brief [1:1] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF2:1;                     /**< \brief [2:2] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF3:1;                     /**< \brief [3:3] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF4:1;                     /**< \brief [4:4] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF5:1;                     /**< \brief [5:5] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF6:1;                     /**< \brief [6:6] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF7:1;                     /**< \brief [7:7] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF8:1;                     /**< \brief [8:8] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF9:1;                     /**< \brief [9:9] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF10:1;                    /**< \brief [10:10] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF11:1;                    /**< \brief [11:11] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF12:1;                    /**< \brief [12:12] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF13:1;                    /**< \brief [13:13] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF14:1;                    /**< \brief [14:14] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF15:1;                    /**< \brief [15:15] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF16:1;                    /**< \brief [16:16] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF17:1;                    /**< \brief [17:17] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF18:1;                    /**< \brief [18:18] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF19:1;                    /**< \brief [19:19] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF20:1;                    /**< \brief [20:20] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF21:1;                    /**< \brief [21:21] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF22:1;                    /**< \brief [22:22] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF23:1;                    /**< \brief [23:23] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF24:1;                    /**< \brief [24:24] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF25:1;                    /**< \brief [25:25] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF26:1;                    /**< \brief [26:26] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF27:1;                    /**< \brief [27:27] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF28:1;                    /**< \brief [28:28] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF29:1;                    /**< \brief [29:29] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF30:1;                    /**< \brief [30:30] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
    unsigned int SF31:1;                    /**< \brief [31:31] Status flag for alarm n belonging to alarm group x (x=0-6). (rwh) */
} Ifx_SMU_AG_Bits;

/** \\brief  Alarm Global Configuration */
typedef struct _Ifx_SMU_AGC_Bits
{
    unsigned int IGCS0:3;                   /**< \brief [2:0] Interrupt Generation Configuration Set 0 (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int IGCS1:3;                   /**< \brief [6:4] Interrupt Generation Configuration Set 1 (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int IGCS2:3;                   /**< \brief [10:8] Interrupt Generation Configuration Set 2 (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int ICS:3;                     /**< \brief [18:16] Idle Configuration Set (rw) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int PES:5;                     /**< \brief [28:24] Port Emergency Stop (rw) */
    unsigned int EFRST:1;                   /**< \brief [29:29] Enable FAULT to RUN State Transition (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_SMU_AGC_Bits;

/** \\brief  Alarm Configuration Register */
typedef struct _Ifx_SMU_AGCF_Bits
{
    unsigned int CF0:1;                     /**< \brief [0:0]  (rw) */
    unsigned int CF1:1;                     /**< \brief [1:1]  (rw) */
    unsigned int CF2:1;                     /**< \brief [2:2]  (rw) */
    unsigned int CF3:1;                     /**< \brief [3:3]  (rw) */
    unsigned int CF4:1;                     /**< \brief [4:4]  (rw) */
    unsigned int CF5:1;                     /**< \brief [5:5]  (rw) */
    unsigned int CF6:1;                     /**< \brief [6:6]  (rw) */
    unsigned int CF7:1;                     /**< \brief [7:7]  (rw) */
    unsigned int CF8:1;                     /**< \brief [8:8]  (rw) */
    unsigned int CF9:1;                     /**< \brief [9:9]  (rw) */
    unsigned int CF10:1;                    /**< \brief [10:10]  (rw) */
    unsigned int CF11:1;                    /**< \brief [11:11]  (rw) */
    unsigned int CF12:1;                    /**< \brief [12:12]  (rw) */
    unsigned int CF13:1;                    /**< \brief [13:13]  (rw) */
    unsigned int CF14:1;                    /**< \brief [14:14]  (rw) */
    unsigned int CF15:1;                    /**< \brief [15:15]  (rw) */
    unsigned int CF16:1;                    /**< \brief [16:16]  (rw) */
    unsigned int CF17:1;                    /**< \brief [17:17]  (rw) */
    unsigned int CF18:1;                    /**< \brief [18:18]  (rw) */
    unsigned int CF19:1;                    /**< \brief [19:19]  (rw) */
    unsigned int CF20:1;                    /**< \brief [20:20]  (rw) */
    unsigned int CF21:1;                    /**< \brief [21:21]  (rw) */
    unsigned int CF22:1;                    /**< \brief [22:22]  (rw) */
    unsigned int CF23:1;                    /**< \brief [23:23]  (rw) */
    unsigned int CF24:1;                    /**< \brief [24:24]  (rw) */
    unsigned int CF25:1;                    /**< \brief [25:25]  (rw) */
    unsigned int CF26:1;                    /**< \brief [26:26]  (rw) */
    unsigned int CF27:1;                    /**< \brief [27:27]  (rw) */
    unsigned int CF28:1;                    /**< \brief [28:28]  (rw) */
    unsigned int CF29:1;                    /**< \brief [29:29]  (rw) */
    unsigned int CF30:1;                    /**< \brief [30:30]  (rw) */
    unsigned int CF31:1;                    /**< \brief [31:31]  (rw) */
} Ifx_SMU_AGCF_Bits;

