keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSmu_regdef.h
/** \\brief  FSP Configuration Register */
typedef struct _Ifx_SMU_AGFSP_Bits
{
    unsigned int FE0:1;                     /**< \brief [0:0]  (rw) */
    unsigned int FE1:1;                     /**< \brief [1:1]  (rw) */
    unsigned int FE2:1;                     /**< \brief [2:2]  (rw) */
    unsigned int FE3:1;                     /**< \brief [3:3]  (rw) */
    unsigned int FE4:1;                     /**< \brief [4:4]  (rw) */
    unsigned int FE5:1;                     /**< \brief [5:5]  (rw) */
    unsigned int FE6:1;                     /**< \brief [6:6]  (rw) */
    unsigned int FE7:1;                     /**< \brief [7:7]  (rw) */
    unsigned int FE8:1;                     /**< \brief [8:8]  (rw) */
    unsigned int FE9:1;                     /**< \brief [9:9]  (rw) */
    unsigned int FE10:1;                    /**< \brief [10:10]  (rw) */
    unsigned int FE11:1;                    /**< \brief [11:11]  (rw) */
    unsigned int FE12:1;                    /**< \brief [12:12]  (rw) */
    unsigned int FE13:1;                    /**< \brief [13:13]  (rw) */
    unsigned int FE14:1;                    /**< \brief [14:14]  (rw) */
    unsigned int FE15:1;                    /**< \brief [15:15]  (rw) */
    unsigned int FE16:1;                    /**< \brief [16:16]  (rw) */
    unsigned int FE17:1;                    /**< \brief [17:17]  (rw) */
    unsigned int FE18:1;                    /**< \brief [18:18]  (rw) */
    unsigned int FE19:1;                    /**< \brief [19:19]  (rw) */
    unsigned int FE20:1;                    /**< \brief [20:20]  (rw) */
    unsigned int FE21:1;                    /**< \brief [21:21]  (rw) */
    unsigned int FE22:1;                    /**< \brief [22:22]  (rw) */
    unsigned int FE23:1;                    /**< \brief [23:23]  (rw) */
    unsigned int FE24:1;                    /**< \brief [24:24]  (rw) */
    unsigned int FE25:1;                    /**< \brief [25:25]  (rw) */
    unsigned int FE26:1;                    /**< \brief [26:26]  (rw) */
    unsigned int FE27:1;                    /**< \brief [27:27]  (rw) */
    unsigned int FE28:1;                    /**< \brief [28:28]  (rw) */
    unsigned int FE29:1;                    /**< \brief [29:29]  (rw) */
    unsigned int FE30:1;                    /**< \brief [30:30]  (rw) */
    unsigned int FE31:1;                    /**< \brief [31:31]  (rw) */
} Ifx_SMU_AGFSP_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_SMU_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int FDIS:1;                    /**< \brief [2:2] Force Disable (rw) */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SMU_CLC_Bits;

/** \\brief  Command Register */
typedef struct _Ifx_SMU_CMD_Bits
{
    unsigned int CMD:4;                     /**< \brief [3:0] Implements the SMU Command Interface. (w) */
    unsigned int ARG:4;                     /**< \brief [7:4] Implements the SMU Command Interface. (w) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SMU_CMD_Bits;

/** \\brief  Debug Register */
typedef struct _Ifx_SMU_DBG_Bits
{
    unsigned int SSM:2;                     /**< \brief [1:0] Running state of the SMU State Machine (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SMU_DBG_Bits;

/** \\brief  Fault Signaling Protocol */
typedef struct _Ifx_SMU_FSP_Bits
{
    unsigned int PRE1:3;                    /**< \brief [2:0] Prescaler1 (rw) */
    unsigned int PRE2:2;                    /**< \brief [4:3] Prescaler2 (rw) */
    unsigned int MODE:2;                    /**< \brief [6:5] Fault Signaling Protocol configuration (rw) */
    unsigned int PES:1;                     /**< \brief [7:7] Port Emergency Stop (PES) (rw) */
    unsigned int TFSP_LOW:14;               /**< \brief [21:8] Specifies the FSP fault state duration (r) */
    unsigned int TFSP_HIGH:10;              /**< \brief [31:22] Specifies the FSP fault state duration (rw) */
} Ifx_SMU_FSP_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_SMU_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_SMU_ID_Bits;

/** \\brief  Key Register */
typedef struct _Ifx_SMU_KEYS_Bits
{
    unsigned int CFGLCK:8;                  /**< \brief [7:0] Configuration Lock (rw) */
    unsigned int PERLCK:8;                  /**< \brief [15:8] Permanent Lock (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SMU_KEYS_Bits;

/** \\brief  SMU Reset Register 0 */
typedef struct _Ifx_SMU_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SMU_KRST0_Bits;

/** \\brief  SMU Reset Register 1 */
typedef struct _Ifx_SMU_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_SMU_KRST1_Bits;

/** \\brief  SMU Reset Status Clear Register */
typedef struct _Ifx_SMU_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_SMU_KRSTCLR_Bits;

